Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: (Irreflexivity)
ja: （非反射）

source: (Reflexivity)
ja: （反射性）

source: (Symmetry)
ja: （対称性）

source: (Transitive comparability)
ja: （推移的比較性）

source: (Transitive incomparability)
ja: （推移的比較不能性）

source: (Transitivity)
ja: （推移性）

source: (true, newMember) if newMember was not contained in self.
ja: (true, newMember)、もしnewMemberがselfに含まれなかったならば。

source: (true, newMember) if newMember was not contained in the set.
ja: (true, newMember)、もしnewMemberがこの集合の中に含まれなかったならば。

source: NS_CLOSED_ENUM for simple enumerations that can never gain new cases
ja: NS_CLOSED_ENUMを決して新しいケース節が増えることが出来ない単純な列挙に対して

source: NS_ENUM for simple enumerations
ja: NS_ENUMを単純な列挙に対して

source: NS_OPTIONS for enumerations whose cases can be grouped into sets of options
ja: NS_OPTIONSを、それのケース節がひとそろいのオプションへとグループにできる列挙に対して

source: NS_TYPED_ENUM for enumerations with a raw value type that you specify
ja: NS_TYPED_ENUMを、あなたが指定する生の値型を使う列挙に対して

source: NS_TYPED_EXTENSIBLE_ENUM for enumerations that you expect might gain more cases
ja: NS_TYPED_EXTENSIBLE_ENUMを、もっとケース節が増えることをあなたが予想する列挙に対して

source: Range instances can represent an empty interval, unlike ClosedRange.
ja: Rangeインスタンスは、空の間隔を表すことができます、ClosedRangeとは違って。

source: T.min.isMultiple(of: -1) is true for signed integer T, even though the quotient T.min / -1 isn’t representable in type T.
ja: T.min.isMultiple(of: -1)はtrueです、符号付き整数Tに対して、たとえ商T.min / -1が型Tで表現可能でなくてさえ。

source: ancestorRepresentation is ignored if subject is not a class instance.
ja: ancestorRepresentationは、subjectがクラスインスタンスでないならば無視されます。

source: areEquivalent(a, a) is always true.
ja: areEquivalent(a, a)は常にtrueである。

source: areEquivalent(a, b) implies areEquivalent(b, a).
ja: areEquivalent(a, b)はareEquivalent(b, a)を意味する。

source: areInIncreasingOrder(a, a) is always false.
ja: areInIncreasingOrder(a, a)は常にfalseである。

source: areInIncreasingOrder must be a strict weak ordering over the elements.
ja: areInIncreasingOrderは、それら要素に対して厳密弱順序でなければなりません。

source: c.lazy.reversed().map(f) maps lazily and returns a LazyMapCollection
ja: c.lazy.reversed().map(f)は遅延にマップしてLazyMapCollectionを返します

source: c.reversed().map(f) maps eagerly and returns a new array
ja: c.reversed().map(f)は、先行にマップして新しい配列を返します

source: c.reversed() does not create new storage
ja: c.reversed()は、新しいストレージを作成しません

source: elements must be finite.
ja: elementsは有限でなければなりません。

source: end must be a valid index of the collection.
ja: endはコレクションのひとつの有効なインデックスでなければなりません。

source: endIndex is always reachable from startIndex by zero or more applications of index(after:).
ja: endIndexは、常にstartIndexからindex(after:)のゼロまたはそれ以上の適用によって到達可能です。

source: hashValue is deprecated as a Hashable requirement.
ja: hashValueは、Hashable要件として非推奨にされます。

source: i must be greater than startIndex.
ja: iはstartIndexより大きくなければなりません。

source: i must be less than endIndex.
ja: iはendIndexより少なくなければなりません。

source: index must be a valid index into the collection.
ja: indexはコレクションに対する有効なインデックスでなければなりません。

source: index must be a valid index of the collection that is not equal to the collection’s end index.
ja: indexは、このコレクションの有効なインデックスでなければなりません、そしてこのコレクションの持つ末尾インデックスと等しくてはなりません。

source: index must be a valid index of the collection.
ja: indexはコレクションの有効なインデックスでなければなりません。

source: index must be in the range 0..Count.
ja: indexは、範囲0..Countの中になければなりません。

source: initialResult is passed to nextPartialResult the first time the closure is executed.
ja: initialResultはnextPartialResultに、クロージャが実行される最初の時に渡されます。

source: k must be greater than or equal to zero and must not exceed the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの中の要素の数を越えてはいけません。

source: k must be greater than or equal to zero, and must be less than or equal to the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの要素数より少ないか等しくなければなりません。

source: k must be greater than or equal to zero.
ja: kは、ゼロより大きいか等しくなければなりません。

source: maxLength must be greater than or equal to zero.
ja: maxLengthは、ゼロより大きいか等しくなければなりません。

source: n must be greater than or equal to zero.
ja: nは、ゼロより大きいか等しくなければなりません。

source: other must be finite.
ja: otherは有限でなければなりません。

source: position must be a valid index of the collection that is not equal to the endIndex property.
ja: positionはコレクションの有効なインデックスで、endIndexプロパティと等しくないものでなければなりません。

source: position must be a valid index of the collection that is not equal to the collection’s end index.
ja: positionは、このコレクションの有効なインデックスでなければなりません、そしてこのコレクションの持つ末尾インデックスと等しくてはなりません。

source: position must be a valid index of the range, and must not equal the range’s end index.
ja: positionは、この範囲の有効なインデックスでなければなりません、そしてこの範囲の持つ末尾インデックスと等しくてはなりません。

source: position must be a valid index of the set, and must not be equal to the set’s end index.
ja: positionは、この集合の有効なインデックスでなければなりません、そしてこの集合の持つ末尾インデックスと等しくてはなりません。

source: possibleStrictSubset must be finite.
ja: possibleStrictSubsetは有限でなければなりません。

source: possibleStrictSuperset must be finite.
ja: possibleStrictSupersetは有限でなければなりません。

source: possibleSubset must be finite.
ja: possibleSubsetは、有限でなければなりません。

source: possibleSuperset must be finite.
ja: possibleSupersetは有限でなければなりません。

source: range must not be empty.
ja: rangeは空であってはいけません。

source: s.lazy.filter { ... }, for an arbitrary sequence s, is a LazyFilterSequence.
ja: s.lazy.filter { ... }は、随意のシーケンスsのための、ひとつのLazyFilterSequenceです。

source: scalars must have the same number of elements as the vector type.
ja: scalarsは、ベクター型と同じ数の要素を持たなければなりません。

source: source must be representable in this type after rounding toward zero.
ja: sourceは、ゼロへの丸め後にこの型において表現可能でなければなりません。

source: start must be a valid index of the collection.
ja: startはコレクションのひとつの有効なインデックスでなければなりません。

source: transform accepts an element of this sequence as its parameter and returns a transformed value of the same or of a different type.
ja: transformはこのシーケンスのひとつの要素をそれのパラメータとして受け取り、同じもしくは異なる型の変換された値を返します。

source: true if element is contained in the range expression; otherwise, false.
ja: true、もしelementがこの範囲式に含まれるならば；そうでなければ、false。

source: true if element is contained in the range; otherwise, false.
ja: elementがこの範囲に含まれるならばtrue；そうでなければ、false。

source: true if i has been offset by exactly distance steps without going beyond limit; otherwise, false.
ja: true、もしiが正確にdistance幅だけlimitを越えていくことなく補われたならば；そうでなければ、falseです。

source: true if lhs is greater than or equal to rhs; otherwise, false.
ja: trueを、lhsがrhsより大きいか等しいならば返します；そうでなければ、false。

source: true if member exists in the set; otherwise, false.
ja: memberがこの集合に含まれるならばtrue；そうでなければ、false。

source: true if the lhs and rhs have the same elements; otherwise, false.
ja: lhsとrhsが同じ要素を持つならばtrue；そうでなければfalse。

source: true if the element was found in the sequence; otherwise, false.
ja: 要素がシーケンスにおいて見つけられなかったならば、true；そうでなければ、false。

source: true if the initial elements of the sequence are equivalent to the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と等しいならば；そうでなければfalse。

source: true if the initial elements of the sequence are the same as the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と同じならば；そうでなければfalse。

source: true if the option set contains member; otherwise, false.
ja: オプションセットがmemberを含むならば、true；そうでなければfalse。

source: true if the sequence contains an element that satisfies predicate; otherwise, false.
ja: このシーケンスがpredicateを満たす要素を含むならばtrue；そうでなければ、false。

source: true if the sequence contains only elements that satisfy predicate; otherwise, false.
ja: true、もしシーケンスがpredicateを満たす要素のみを含むならば；そうでなければ、false。

source: true if the set has no elements in common with other; otherwise, false.
ja: この集合がotherと共通の要素を持たないならばtrue；そうでなければ、false。

source: true if the set is a strict subset of other; otherwise, false.
ja: この集合がotherの狭義の部分集合ならばtrue；そうでなければ、false。

source: true if the set is a strict superset of other; otherwise, false.
ja: この集合がotherの狭義の上位集合であるならばtrue；そうでなければ、false。

source: true if the set is a strict superset of possibleStrictSubset; otherwise, false.
ja: true、もしこの集合がpossibleStrictSubsetの狭義の上位集合であるならば；そうでなければ、false。

source: true if the set is a subset of other; otherwise, false.
ja: この集合がotherの部分集合ならばtrue；そうでなければ、false。

source: true if the set is a subset of possibleSuperset; otherwise, false.
ja: true、もしこの集合がpossibleSupersetの部分集合ならば；そうでなければ、false。

source: true if the set is a superset of other; otherwise, false.
ja: この集合がotherの上位集合であるならばtrue；そうでなければ、false。

source: true if the set is a superset of possibleSubset; otherwise, false.
ja: true、この集合がpossibleSubsetの上位集合であるならば；そうでなければ、false。

source: true if this range and other have at least one element in common; otherwise, false.
ja: この範囲とotherが少なくとも１つの共通の要素を持つならば、true；そうでなければ、false。

source: true if this sequence and other contain equivalent items, using areEquivalent as the equivalence test; otherwise, false.
ja: true、このシーケンスとotherがareEquivalentを同等性テストとして使って同じ要素らを含むならば；そうでなければ、false。

source: true if this sequence and other contain the same elements in the same order.
ja: このシーケンスとotherが同じ要素を同じ順序で含んでいるならば、true。

source: true if this sequence precedes other in a dictionary ordering as ordered by areInIncreasingOrder; otherwise, false.
ja: true、もしこのシーケンスがotherに、areInIncreasingOrderによって並べられる通りの字典順序において先行するならば；そうでなければ、false。

source: true if this sequence precedes other in a dictionary ordering; otherwise, false.
ja: このシーケンスがotherに、ある字典順序において先行するならば、true；そうでなければ、false。

source: true is the set is strict subset of possibleStrictSuperset; otherwise, false.
ja: trueならばこの集合はpossibleStrictSupersetの狭義の部分集合です；そうでなければ、false。

source: x.contains(e) && y.contains(e) if and only if x.intersection(y).contains(e)
ja: x.contains(e) && y.contains(e) は次の場合に限ります x.intersection(y).contains(e)

source: x.contains(e) implies x.union(y).contains(e)
ja: x.contains(e) は暗黙的に x.union(y).contains(e)

source: x.isMultiple(of: 0) is true if x is zero and false otherwise.
ja: x.isMultiple(of: 0)はtrueです、もしxがゼロであるならば、そしてそうでなければfalseです。

source: x.isStrictSubset(of: y) if and only if x.isSubset(of: y) && x != y
ja: x.isStrictSubset(of: y) は次の場合に限ります x.isSubset(of: y) && x != y

source: x.isStrictSuperset(of: y) if and only if x.isSuperset(of: y) && x != y
ja: x.isStrictSuperset(of: y) は次の場合に限ります x.isSuperset(of: y) && x != y

source: x.isSubset(of: y) if and only if y.isSuperset(of: x)
ja: x.isSubset(of: y) は次の場合に限ります y.isSuperset(of: x)

source: x.isSubset(of: y) implies x.union(y) == y
ja: x.isSubset(of: y) は暗黙的に x.union(y) == y

source: x.isSuperset(of: y) implies x.union(y) == x
ja: x.isSuperset(of: y) は暗黙的に x.union(y) == x

source: x.union(y).contains(e) implies x.contains(e) || y.contains(e)
ja: x.union(y).contains(e) は暗黙的に x.contains(e) || y.contains(e)

source: Optional.none is equivalent to the nil literal.
ja: Optional.noneは、nilリテラルに等しいです。

source: count must be zero or greater.
ja: countは、ゼロまたはより大きくなければなりません。

source: distance must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: distanceは、そのコレクションがBidirectionalCollectionプロトコルに準拠するのでない限り、負であってはなりません。

source: radix must be in the range 2...36.
ja: radixは、範囲2...36の中でなければなりません。

source: rhs must not be zero.
ja: rhsは、ゼロではなりません。

source: ShippingOptions includes a rawValue property of type Int that stores the bit mask of available shipping options.
ja: ShippingOptionsは、型IntのrawValueプロパティを含みます、それは可能な出荷オプションのビットマスクを格納します。

source: T may have a lower minimal alignment that trades runtime performance for space efficiency.
ja: Tは、空間能率に対する実行時性能と引き換えに、より低い極小のアラインメントを持ってもかまいません。

source: element is contained in the range if it is greater than or equal to the lower bound and less than the upper bound.
ja: elementが範囲の中のに含まれるのは、それが下方境界より大きいか等しく上方境界より少ない場合です。

source: maxSplits must be greater than or equal to zero.
ja: maxSplitsは、ゼロより大きいか等しくなければなりません。

source: for-in loops are safe in this regard.
ja: for-inループはこの点に関して安全です。

source: Optional.some(Wrapped) stores a wrapped value.
ja: Optional.some(Wrapped)は、あるラップされた値を格納します。

source: RangeReplaceableCollection provides default implementations of all its other methods using this initializer and method.
ja: RangeReplaceableCollectionは、それの他のメソッドすべての省略時の実装をこのイニシャライザとメソッドを使って提供します。

source: Required. Default implementation provided.
ja: 必須。 省略時の実装の提供。

source: Required. Default implementations provided.
ja: 必須。 いくつかの省略時の実装の提供。

source: See Also
ja: 参照

source: A 16-bit signed integer value type.
ja: 16ビット符号つき整数値型。

source: A 32-bit signed integer value type.
ja: 32ビット符号つき整数値型。

source: A 64-bit integer value converts to an MLDataValue.ValueType.int.
ja: 64ビット整数値は、MLDataValue.ValueType.intに変わります。

source: A 64-bit signed integer value type.
ja: 64ビット符号付き整数値型。

source: A Collection that provides its own implementation of this method must also guarantee that an equivalent buffer of its SubSequence can be generated by advancing the pointer by the distance to the slice’s startIndex.
ja: このメソッドのそれ独自の実装を提供するCollectionはまた、それのSubSequenceの同等のバッファが、スライスのもつstartIndexへの隔たりだけポインタを前進することによって生成されることを保証しなければなりません。

source: A Collection whose elements consist of those in a Base Collection passed through a transform function returning Element.
ja: あるCollection、その要素はBase Collectionの中のものから成り、Elementを返す変換関数を通して渡されます。

source: A Result instance with the result of evaluating transform as the new failure value if this instance represents a failure.
ja: あるResultインスタンスでtransformを評価する結果をもちます、もしこのインスタンスが失敗を表すならば新しい失敗値として。

source: A Result instance with the result of evaluating transform as the new success value if this instance represents a success.
ja: あるResultインスタンス、transformを評価する結果をもつ、もしこのインスタンスが成功を表すならば新しい成功値として。

source: A Result instance, either from the closure or the previous .failure.
ja: Resultインスタンス、クロージャまたは前の.failureのどちらかから。

source: A Result instance, either from the closure or the previous .success.
ja: Resultインスタンス、クロージャまたは前の.successのどちらかから。

source: A Sequence that can contain the same elements as this one, possibly with a simpler type.
ja: このものと同じ要素を、できる限りより簡単な型で、含むSequence。

source: A Sequence whose elements consist of those in a Base Sequence passed through a transform function returning Element.
ja: あるSequence、その要素はBase Sequencellectionの中のものから成り、Elementを返す変換関数を通して渡されます。

source: A ReversedCollection instance wraps an underlying collection and provides access to its elements in reverse order.
ja: ReversedCollectionインスタンスは、基礎をなすコレクションをラップして、それの要素へのアクセスを逆順で提供します。

source: A Range instance does not contain its upper bound.
ja: Rangeインスタンスはそれの上方の境界を含みません。

source: A Boolean value indicating whether the collection is empty.
ja: コレクションが空かどうかを指し示すブール値。

source: A Boolean value indicating whether the range contains no elements.
ja: 範囲が何の要素も含まないかどうかを指し示すブール値を返します。

source: A Boolean value indicating whether this type is a signed integer type.
ja: この型が符号付き整数型であるかどうかを指し示すブール値。

source: A Boolean value that indicates whether the set has no elements.
ja: 集合が要素をひとつも持たないかどうかを指し示すブール値。

source: A Boolean value that indicates whether the set is empty.
ja: 集合が空かどうかを指し示すブール値。

source: A Combine publisher that publishes each member of the sequence as a separate element.
ja: あるCombineパブリッシャー、それはシーケンスの各要素を別個の要素として発行します。

source: A Combine publisher that publishes this instance’s result to each subscriber exactly once, or fails immediately if the result indicates failure.
ja: あるCombineパブリッシャー、それはこのインスタンスのもつ結果を各加入者に正確に一度だけ発行します、または結果が不成功を指し示すならば直ぐに失敗します。

source: A Combine publisher that publishes this instance’s value to each subscriber exactly once, if it has a value at all.
ja: あるCombineパブリッシャー、それはこのインスタンスのもつ値を各加入者に正確に一度だけ発行します、とにかくそれが値を持つならば。

source: A SIMD vector of a fixed number of elements.
ja: 固定された数の要素のSIMDベクター。

source: A bitwise AND operation results in a value that has each bit set to 1 where both of its arguments have that bit set to 1.
ja: ビット単位AND演算は、ある値という結果になります、それが各ビットを1に設定するのは、両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise OR operation results in a value that has each bit set to 1 where one or both of its arguments have that bit set to 1.
ja: ビット単位OR演算は、ある値という結果になります、それが各ビットを1に設定するのは、一方または両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise XOR operation, also known as an exclusive OR operation, results in a value that has each bit set to 1 where one or the other but not both of its arguments had that bit set to 1.
ja: ビット単位XOR演算、または排他的OR演算として知られるものは、１つの値という結果になり、それは各ビットが1に設定されます、そこにおいて一方または他方しかし両方でなくそれの引数がそのビットを1に設定されます。

source: A class that conforms to the CustomReflectable protocol can control how its mirror represents ancestor classes by initializing the mirror with an AncestorRepresentation.
ja: CustomReflectableプロトコルに準拠するクラスは、どのようにそれのミラーが先祖クラスを表すかを、ミラーをAncestorRepresentationで初期化することで制御できます。

source: A class whose instances contain a property of type Header and raw storage for an array of Element, whose size is determined at instance creation.
ja: あるクラス、そのインスタンスは型Headerのプロパティと、そのサイズがインスタンス作成時に決められる、Element配列の生のストレージを含みます。

source: A closed range to convert to a Range instance.
ja: Rangeインスタンスへ変換することになるある完結範囲。

source: A closure that accepts an element of this sequence as its argument and returns a sequence or collection.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、あるシーケンスまたはコレクションを返すものです。

source: A closure that accepts an element of this sequence as its argument and returns an optional value.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、ひとつのオプショナルの値を返すものです。

source: A closure that combines an accumulating value and an element of the sequence into a new accumulating value, to be used in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それは蓄積値をシーケンスのいち要素と結合して新しい蓄積値とし、nextPartialResultクロージャの次の呼び出しにおいて使われるか、呼び出し側に返されるようにします。

source: A closure that returns true if its argument should be used to split the sequence; otherwise, false.
ja: １つのクロージャ、それはそれの引数が使われてシーケンスを分割するならばtrueを；そうでなければ、falseを返します。

source: A closure that returns a Boolean value indicating whether two elements are equivalent.
ja: ２つの要素が等しいかどうかを指し示しているブール値を返すクロージャ。

source: A closure that takes an element as an argument and returns a Boolean value indicating whether the collection should be split at that element.
ja: あるクロージャ、それは１つの要素を引数として取り、コレクションがその要素で分割されるかどうかを指し示すブール値を返します。

source: A closure that takes an element as its argument and returns a Boolean value indicating whether the element should be included in the returned set.
ja: あるクロージャ、それはある要素をそれの引数として取り、その要素が返される集合に含まれるべきかどうかを示すブール値を返すものです。

source: A closure that takes an element as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as a parameter.
ja: あるクロージャ、それはシーケンスの１要素を引数として取ります。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false if it should be excluded.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueをまたはそれが除外されるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false otherwise.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueを、またはそうでなければfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false if it should be included.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueをまたはそれが含まれるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false otherwise.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueを、またはそうでなければfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element is a match.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が合致するものかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the result.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が結果に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned array.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が返される配列に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned collection.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が返されるコレクションに含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be removed from the collection.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素がコレクションから除去されるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素がある条件を満たすかどうかを指し示すブール値を返します。

source: A closure that takes the failure value of the instance.
ja: インスタンスの失敗値をとるクロージャ。

source: A closure that takes the success value of the instance.
ja: そのインスタンスの成功した値をとるクロージャ。

source: A closure that takes the success value of this instance.
ja: このインスタンスの成功した値をとるクロージャ。

source: A closure that takes the unwrapped value of the instance.
ja: このインスタンスのアンラップされた値をとるクロージャ。

source: A closure that updates the accumulating value with an element of the sequence.
ja: 蓄積される値をこのシーケンスのある要素を使って更新するクロージャ。

source: A collection containing a single element.
ja: 単一の要素を含んでいるコレクション。

source: A collection containing the same elements as a Base collection, but on which some operations such as map and filter are implemented lazily.
ja: Baseコレクションと同じ要素を含んでいるあるコレクション、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A collection containing the words of this value’s binary representation, in order from the least significant to most significant.
ja: この値の持つバイナリ表現の単語いくらかを含んでいるコレクション、最下位から最上位への順番で。

source: A collection of Child elements describing the structure of the reflected subject.
ja: Child要素のコレクションで、リフレクションされる主題の構造体を記述しています。

source: A collection of insertions and removals that describe the difference between two ordered collection states.
ja: ２つの順序付きコレクション状態の間の差異を記述するいくらかの挿入と除去からなるあるコレクション。

source: A collection of the elements that isIncluded allowed.
ja: isIncludedを認められた要素それらからなるあるコレクション。

source: A collection on which normally-eager operations such as map and filter are implemented lazily.
ja: あるコレクション、それにおいては通常は先行な演算、例えばmapやfilterは、遅延に実装されます。

source: A collection or finite sequence.
ja: コレクションまたは有限のシーケンス。

source: A collection that presents the elements of its base collection in reverse order.
ja: あるコレクション、それは、それの基盤コレクションの要素を逆順で提示します。

source: A collection that represents a contiguous subrange of the collection’s elements.
ja: コレクションのもつ要素の隣接下位範囲を表すコレクション。

source: A collection that supports backward as well as forward traversal.
ja: 前方にだけでなく後方へ辿っていくこともサポートするコレクション。

source: A collection that supports efficient random-access index traversal.
ja: 効率のよい無作為アクセスのインデックス探査をサポートするコレクション。

source: A collection that supports replacement of an arbitrary subrange of elements with the elements of another collection.
ja: 随意の下位範囲の要素を別のコレクションの要素で置き換えることをサポートするコレクション。

source: A collection that supports subscript assignment.
ja: 添え字を使った代入をサポートするコレクション。

source: A collection whose element type is Element but that is always empty.
ja: それの要素型はElementである、しかし常に空であるコレクション。
